#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
data.aws_ecr_image.lambda_image: Reading...
data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:09e274e91320641086b98532c6c37b83292e08b64996b8a03a50694292c43e7c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ecr.aws_ecr_repository.lambda_repo will be created
  + resource "aws_ecr_repository" "lambda_repo" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "testing-dev-cognito-backup-restore"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags                 = {
          + "Name" = "testing-dev-cognito-backup-restore"
        }
      + tags_all             = {
          + "Name" = "testing-dev-cognito-backup-restore"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.lambdas.aws_iam_role.lambda_execution_role will be created
  + resource "aws_iam_role" "lambda_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "testing-dev-lambda_execution_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "testing-dev-Cognito-Backup-Lambda-Execution-Role"
        }
      + tags_all              = {
          + "Name" = "testing-dev-Cognito-Backup-Lambda-Execution-Role"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.lambdas.aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id          = (known after apply)
      + name        = "testing-dev-cognito-lambda-backup-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.lambdas.aws_lambda_function.cognito_backup_restore will be created
  + resource "aws_lambda_function" "cognito_backup_restore" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "testing-dev-cognito-backup-restore"
      + id                             = (known after apply)
      + image_uri                      = "339713055209.dkr.ecr.eu-west-2.amazonaws.com/backups@sha256:09e274e91320641086b98532c6c37b83292e08b64996b8a03a50694292c43e7c"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "testing-dev-Cognito-Backup-restore"
        }
      + tags_all                       = {
          + "Name" = "testing-dev-Cognito-Backup-restore"
        }
      + timeout                        = 600
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BACKUP_BUCKET_NAME" = "testing-dev-influxdb-backup-bucket-aaa"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.s3.aws_cloudwatch_log_group.lambda_logs will be created
  + resource "aws_cloudwatch_log_group" "lambda_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/testing-dev-cognito-backup-restore"
      + name_prefix       = (known after apply)
      + region            = "eu-west-2"
      + retention_in_days = 14
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "Name"        = "Cognito Backup Lambda Logs"
          + "Project"     = "cognito-backup-restore"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "Name"        = "Cognito Backup Lambda Logs"
          + "Project"     = "cognito-backup-restore"
        }
    }

  # module.s3.aws_s3_bucket.influxdb_backup_bucket will be created
  + resource "aws_s3_bucket" "influxdb_backup_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "testing-dev-influxdb-backup-bucket-aaa"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "testing-dev-influxdb-backup-bucket"
        }
      + tags_all                    = {
          + "Name" = "testing-dev-influxdb-backup-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3.aws_s3_bucket_lifecycle_configuration.influxdb_backup_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "influxdb_backup_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "eu-west-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "FullBackupRetention"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 120
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "influx-backups/monthly/"
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }
      + rule {
          + id     = "DailyBackupRetention"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 35
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "influx-backups/daily/"
            }
        }
    }

  # module.s3.aws_s3_bucket_policy.influxdb_backup_policy will be created
  + resource "aws_s3_bucket_policy" "influxdb_backup_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
      + region = "eu-west-2"
    }

  # module.s3.aws_s3_bucket_public_access_block.influxdb_backup_public_access will be created
  + resource "aws_s3_bucket_public_access_block" "influxdb_backup_public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-west-2"
      + restrict_public_buckets = true
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.backups_bucket_encryption will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "backups_bucket_encryption" {
      + bucket = "testing-dev-influxdb-backup-bucket-aaa"
      + id     = (known after apply)
      + region = "eu-west-2"

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.influxdb_backup_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "influxdb_backup_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + image_uri = "339713055209.dkr.ecr.eu-west-2.amazonaws.com/backups@sha256:09e274e91320641086b98532c6c37b83292e08b64996b8a03a50694292c43e7c"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @daveacho, Action: `pull_request`, Workflow: `Pull Request on Dev environment`*